In [2]:
import pandas as pd
data=pd.read_csv("Book1.csv")
data

  Name  Salary Country
0    a       1   India
1    b       2       X
2    c       3       y
3    d       4       z

In [4]:
data['Salary'].mean()

2.5

In [15]:
sum=data['Salary'].sum()
sum

10

In [18]:
max=data['Salary'].max()
max

4

In [20]:
min=data['Salary'].min()
min

1

In [33]:
data.mean()

C:\Users\ompan\AppData\Local\Temp\ipykernel_23508\531903386.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean()

Salary    2.5
dtype: float64

In [35]:
data['Salary'].sum()

10

In [38]:
data['Salary'].var()

1.6666666666666667

In [39]:
data['Salary'].skew()

0.0

In [5]:
data.describe(include= 'all')

       Name    Salary Country
count     4  4.000000       4
unique    4       NaN       4
top       a       NaN   India
freq      1       NaN       1
mean    NaN  2.500000     NaN
std     NaN  1.290994     NaN
min     NaN  1.000000     NaN
25%     NaN  1.750000     NaN
50%     NaN  2.500000     NaN
75%     NaN  3.250000     NaN
max     NaN  4.000000     NaN